In [60]:
import pandas as pd
import numpy as np

In [61]:
pd.Series(range(100,110), dtype =float)

0    100.0
1    101.0
2    102.0
3    103.0
4    104.0
5    105.0
6    106.0
7    107.0
8    108.0
9    109.0
dtype: float64

In [63]:
pd.DataFrame(data = np.random.randint(10,20, (5,5)),index= ["A", "B", "C", "D", "E"], columns =np.random.randint(30,60,(5,)))

   35  30  50  44  33
A  15  16  13  16  18
B  10  18  19  10  15
C  12  11  17  16  12
D  11  12  18  18  12
E  18  12  14  10  16

In [64]:
names = ["Anuj", "Naman", "Mohot"]
ages= [20,19,29]

In [65]:
d={"names":names,"ages":ages}

In [66]:
d

{'names': ['Anuj', 'Naman', 'Mohot'], 'ages': [20, 19, 29]}

In [67]:
pd.DataFrame(d)

   names  ages
0   Anuj    20
1  Naman    19
2  Mohot    29

In [68]:
li = [{"name":"Anuj", "age": 25},{"name":"Mohit", "age": 28}]

In [69]:
df =pd.DataFrame(li)

In [70]:
df.to_csv("hello.csv")

In [71]:
df = pd.read_csv("hello.csv")

In [72]:
df

   Unnamed: 0   name  age
0           0   Anuj   25
1           1  Mohit   28

In [73]:
df.to_html("hello.html")

In [74]:
df.name

0     Anuj
1    Mohit
Name: name, dtype: object

In [75]:
df["name"]

0     Anuj
1    Mohit
Name: name, dtype: object

In [76]:
df["place"]= ["Delhi"] * 2

In [77]:
df

   Unnamed: 0   name  age  place
0           0   Anuj   25  Delhi
1           1  Mohit   28  Delhi

In [78]:
df[["name", "place"]]

    name  place
0   Anuj  Delhi
1  Mohit  Delhi

In [79]:
df

   Unnamed: 0   name  age  place
0           0   Anuj   25  Delhi
1           1  Mohit   28  Delhi

In [80]:
df.loc[df.age >26]

   Unnamed: 0   name  age  place
1           1  Mohit   28  Delhi

In [85]:
df.iloc[::-1, 1:]

    name  age  place
1  Mohit   28  Delhi
0   Anuj   25  Delhi

In [86]:
df.age >26

0    False
1     True
Name: age, dtype: bool

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
Unnamed: 0    2 non-null int64
name          2 non-null object
age           2 non-null int64
place         2 non-null object
dtypes: int64(2), object(2)
memory usage: 192.0+ bytes

In [88]:
df.describe()

       Unnamed: 0       age
count    2.000000   2.00000
mean     0.500000  26.50000
std      0.707107   2.12132
min      0.000000  25.00000
25%      0.250000  25.75000
50%      0.500000  26.50000
75%      0.750000  27.25000
max      1.000000  28.00000

In [92]:
df.sort_values("name")

   Unnamed: 0   name  age  place
0           0   Anuj   25  Delhi
1           1  Mohit   28  Delhi